In [15]:
#ADDING COLUMNS
import pandas as pd
data={"Name":["shabaul","saif","amaan","pritam","jibrail","saud","afzal","jibran"],
       "Age":[10,20,30,40,50,60,70,80],
       "Salary":[10000,20000,30000,40000,50000,60000,700000,80000],
       "Performance Score":[80,85,43,45,69,78,88,98]
      }
df=pd.DataFrame(data)
print(df)

      Name  Age  Salary  Performance Score
0  shabaul   10   10000                 80
1     saif   20   20000                 85
2    amaan   30   30000                 43
3   pritam   40   40000                 45
4  jibrail   50   50000                 69
5     saud   60   60000                 78
6    afzal   70  700000                 88
7   jibran   80   80000                 98

In [17]:
#Adding a new column in a Pandas DataFrame is very easy — just like assigning a value to a dictionary key.
# Syntax to Add a New Column
#syntax 1: df['new_column_name'] = values  #it adds the column at last position of column index
#syntax 2: df.insert(loc,"Column_name",data), where loc means location(index),based on column and not on rows
#there are two ways of adding columns in a dataframe:
# | Method              | What it does                      |
# | ------------------- | --------------------------------- |
# | `df['Col'] = data`   | Adds column at the end (default)  |
# | `df.insert(loc,col,name, data ...)` | Adds column at specific index `i` |

In [21]:
# adding new column at last position of column
df["Bonus"]=df["Salary"]*0.1  # method 1: directly assigning value
print(df)

      Name  Age  Salary  Performance Score    Bonus
0  shabaul   10   10000                 80   1000.0
1     saif   20   20000                 85   2000.0
2    amaan   30   30000                 43   3000.0
3   pritam   40   40000                 45   4000.0
4  jibrail   50   50000                 69   5000.0
5     saud   60   60000                 78   6000.0
6    afzal   70  700000                 88  70000.0
7   jibran   80   80000                 98   8000.0

In [53]:
# adding new column at specific position of column
df.insert(0,"Employee_ID",[i for i in range(1,9)]) # employee_id column added at column position 0.
print(df)

   Employee_ID     Name  Age  Salary  Performance Score    Bonus
0            1  shabaul   10   10000                 80   1000.0
1            2     saif   20   20000                 85   2000.0
2            3    amaan   30   30000                 43   3000.0
3            4   pritam   40   40000                 45   4000.0
4            5  jibrail   50   50000                 69   5000.0
5            6     saud   60   60000                 78   6000.0
6            7    afzal   70  700000                 88  70000.0
7            8   jibran   80   80000                 98   8000.0

In [55]:
# The full form of .loc in Pandas is:
# .loc → Location
# .loc stands for "Label-based location"
#It is used to access data in a DataFrame using labels (not integer positions).
# Works with both default and custom index.

# df.loc[row_label, column_name]
# Examples of .loc[]:
# Get full row with label 1:
# df.loc[1]

# 2. Get Salary of row with label 1:
# df.loc[1, "Salary"]

In [57]:
# The full form of .iloc in Pandas is:
# .iloc → Integer Location
# .iloc stands for "Integer-location based indexing"
# It is used to access data in a DataFrame using integer positions (like list indexes).
# Works only with positional index (starting from 0), not custom labels.

# Syntax: df.iloc[row_position, column_position]

# Examples of .iloc[]:
# Get full row at position 1 (second row):
# df.iloc[1]

# Get specific value at row 1, column 2:
# df.iloc[1, 2]

# Get first 3 rows:
# df.iloc[0:3]

# Get entire column at index position 1:
# df.iloc[:, 1]

In [59]:
# updating value of a dataframe
#1. salary of every row has been updated
df["Salary"]=df["Salary"]*1.05  
df

   Employee_ID     Name  Age    Salary  Performance Score    Bonus
0            1  shabaul   10   10500.0                 80   1000.0
1            2     saif   20   21000.0                 85   2000.0
2            3    amaan   30   31500.0                 43   3000.0
3            4   pritam   40   42000.0                 45   4000.0
4            5  jibrail   50   52500.0                 69   5000.0
5            6     saud   60   63000.0                 78   6000.0
6            7    afzal   70  735000.0                 88  70000.0
7            8   jibran   80   84000.0                 98   8000.0

In [71]:
df.loc[0,"Salary"]=20000  # updating a specific person's salary using .loc
df

   Employee_ID     Name  Age    Salary  Performance Score    Bonus
0            1  shabaul   10   20000.0                 80   1000.0
1            2     saif   20   21000.0                 85   2000.0
2            3    amaan   30   31500.0                 43   3000.0
3            4   pritam   40   42000.0                 45   4000.0
4            5  jibrail   50   52500.0                 69   5000.0
5            6     saud   60   63000.0                 78   6000.0
6            7    afzal   70  735000.0                 88  70000.0
7            8   jibran   80   84000.0                 98   8000.0

In [75]:
# removing column
# In Pandas, a column is removed using either of the following methods:
# Method 1: df.drop()
# df.drop("column_name", axis=1, inplace=True)  # when you write true here, it will do a change in original dataframe
# df.drop(columns=["ColumnName"],inplace=True)  # when you write false here, it will return a new dataframe

# Method 2: del keyword
# del df["Salary"]

# Method 3: Using .pop()
# df.pop("column_name")
# This also removes the column and returns it.
# removed_column = df.pop("Salary")

In [81]:
#using drop
df.drop(columns="Performance Score", inplace=False) # inplace =false, so returned a new dataframe, no change in original dataframe

   Employee_ID     Name  Age    Salary    Bonus
0            1  shabaul   10   20000.0   1000.0
1            2     saif   20   21000.0   2000.0
2            3    amaan   30   31500.0   3000.0
3            4   pritam   40   42000.0   4000.0
4            5  jibrail   50   52500.0   5000.0
5            6     saud   60   63000.0   6000.0
6            7    afzal   70  735000.0  70000.0
7            8   jibran   80   84000.0   8000.0

In [85]:
print(df) # original dataframe still has performance score

   Employee_ID     Name  Age    Salary  Performance Score    Bonus
0            1  shabaul   10   20000.0                 80   1000.0
1            2     saif   20   21000.0                 85   2000.0
2            3    amaan   30   31500.0                 43   3000.0
3            4   pritam   40   42000.0                 45   4000.0
4            5  jibrail   50   52500.0                 69   5000.0
5            6     saud   60   63000.0                 78   6000.0
6            7    afzal   70  735000.0                 88  70000.0
7            8   jibran   80   84000.0                 98   8000.0

In [89]:
df.drop(columns="Performance Score",inplace=True) # inplace = True, done a change in original dataframe
print(df)

   Employee_ID     Name  Age    Salary    Bonus
0            1  shabaul   10   20000.0   1000.0
1            2     saif   20   21000.0   2000.0
2            3    amaan   30   31500.0   3000.0
3            4   pritam   40   42000.0   4000.0
4            5  jibrail   50   52500.0   5000.0
5            6     saud   60   63000.0   6000.0
6            7    afzal   70  735000.0  70000.0
7            8   jibran   80   84000.0   8000.0

In [91]:
#Handling Missing Data
# In Python and Pandas, NaN and None are both used to represent missing or null values
# Feature	NaN (numpy.nan)	None
# Full form	Not a Number	None (null object)
# Type	float (from NumPy)	NoneType (built-in)
# Used Mostly in numerical data (Pandas/NumPy)	General Python (any object)

In [3]:
# TO CHECK MISSING VALUES
# isnull() is a method used to check whether a value is present in a dataset or not
#it returns the value in the form of boolean(true or false)
#here, true means the value is missing and false means the value is present
import pandas as pd
data2={"Name":["shabaul",None,"amaan","pritam","jibrail","saud","afzal","jibran"],
       "Age":[10,None,30,40,50,60,70,80],
       "Salary":[10000,None,30000,40000,50000,60000,700000,80000],
       "Performance Score":[80,None,43,45,69,78,88,98]
      }
dff=pd.DataFrame(data2)
print(dff)

      Name   Age    Salary  Performance Score
0  shabaul  10.0   10000.0               80.0
1     None   NaN       NaN                NaN
2    amaan  30.0   30000.0               43.0
3   pritam  40.0   40000.0               45.0
4  jibrail  50.0   50000.0               69.0
5     saud  60.0   60000.0               78.0
6    afzal  70.0  700000.0               88.0
7   jibran  80.0   80000.0               98.0

In [9]:
dff.isnull()
#will give false where data is present, will give true when data is absent.

    Name    Age  Salary  Performance Score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False

In [13]:
# it counts how many True values (i.e. nulls) are there in each column.
print(dff.isnull().sum())

Name                 1
Age                  1
Salary               1
Performance Score    1
dtype: int64

In [19]:
# to handle missing values, there are two ways: 1. remove that value 2. fill that value
#during data analysis, if that missing value is not important, remove it
#ifthat missing value is important, fill it

#.dropna()
#.dropna() is a Pandas method used to remove missing values (NaN/None) from a DataFrame or Series.
dff.dropna(axis=0,inplace=True)   #axis=0 means, rows with missing values will be deleted and inplace=true means original dataframe will be changed
print(dff)                               #axis=1 means, column with missing values will be deleted

      Name   Age    Salary  Performance Score
0  shabaul  10.0   10000.0               80.0
2    amaan  30.0   30000.0               43.0
3   pritam  40.0   40000.0               45.0
4  jibrail  50.0   50000.0               69.0
5     saud  60.0   60000.0               78.0
6    afzal  70.0  700000.0               88.0
7   jibran  80.0   80000.0               98.0

In [25]:
#.fillna() is a method in pandas used to replace missing values (NaN or None) with some other value.
#syntax= dff.fillna(value,inplace=True)

import pandas as pd
data3={"Name":["shabaul",None,"amaan","pritam","jibrail","saud","afzal","jibran"],
       "Age":[10,None,30,40,50,60,70,80],
       "Salary":[10000,None,30000,40000,50000,60000,700000,80000],
       "Performance Score":[80,None,43,45,69,78,88,98]
      }
dfd=pd.DataFrame(data3)
print(dfd)

      Name   Age    Salary  Performance Score
0  shabaul  10.0   10000.0               80.0
1     None   NaN       NaN                NaN
2    amaan  30.0   30000.0               43.0
3   pritam  40.0   40000.0               45.0
4  jibrail  50.0   50000.0               69.0
5     saud  60.0   60000.0               78.0
6    afzal  70.0  700000.0               88.0
7   jibran  80.0   80000.0               98.0

In [33]:
#filling the age column with mean age value
dfd["Age"].fillna(dfd["Age"].mean(),inplace=True)  #this will fill the missing values in age with mean value of age
dfd

C:\Users\shaba\AppData\Local\Temp\ipykernel_7300\810772792.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dfd["Age"].fillna(dfd["Age"].mean(),inplace=True)

      Name        Age    Salary  Performance Score
0  shabaul  10.000000   10000.0               80.0
1     None  48.571429       NaN                NaN
2    amaan  30.000000   30000.0               43.0
3   pritam  40.000000   40000.0               45.0
4  jibrail  50.000000   50000.0               69.0
5     saud  60.000000   60000.0               78.0
6    afzal  70.000000  700000.0               88.0
7   jibran  80.000000   80000.0               98.0

In [35]:
# Feature	               df = df.fillna(0)	                    df.fillna(0, inplace=True)
# Modifies df?	             ✅ Yes	                                   ✅ Yes
# Returns a new object?	     ✅ Yes (a new DataFrame)	               ❌ No (returns None)
# Original df changed?	    ✅ Yes, because you reassigned it	      ✅ Yes, because it was changed in-place


# In older versions of Pandas, inplace=True was believed to be faster because it modified the object directly. But in modern Pandas (1.5+ and 2.x), 
# both usually perform similarly because operations like fillna() still create a copy internally. So there's no significant performance gain.
# The recommended approach today is df = df.fillna(0) for clarity and safety

In [37]:
#interpolation
#Interpolation is used to fill missing values (NaN) in a DataFrame or Series using estimated values based on other data points.
#The .interpolate() method is used to fill missing values (NaN) by estimating them using other existing values.

# different types of interpolation :-
# | Method         | Description                                         |
# | -------------- | --------------------------------------------------- |
# | `'linear'`     | Default. Straight-line interpolation between points |
# | `'time'`       | For time series with datetime index                 |
# | `'polynomial'` | Requires `order=2` or higher                        |
# | `'spline'`     | Smooth curve interpolation                          |
# | `'pad'`        | Forward fill (`ffill`)                              |
# | `'bfill'`      | Backward fill                                       |

In [49]:
#linear interpolation
# Linear interpolation means filling in a missing value by drawing a straight line between two known values and 
# estimating the value that should be in between.

# Example:
# | Day | Temperature |
# | --- | ----------- |
# | 1   | 20°C        |
# | 2   | NaN         |
# | 3   | 30°C        |
#So Day 2 = 25 (mid-point between 20 and 30)

data4={"Time":[1,2,3,4,5],
       "Value":[10,None,30,None,50]
    
}
da=pd.DataFrame(data4)
print("Before Interpolation:")
print(da)

da["Value"]=da["Value"].interpolate(method="linear")
print("After Interpolation")
print(da)

Before Interpolation:
   Time  Value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0
After Interpolation
   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [55]:
# performing polynomial interpolation
import pandas as pd
data5={
    "X":[1,2,3,4,5,6,7,8],
    "Y":[10,None,30,None,50,None,70,None]
    
}
dp=pd.DataFrame(data5)
dp

   X     Y
0  1  10.0
1  2   NaN
2  3  30.0
3  4   NaN
4  5  50.0
5  6   NaN
6  7  70.0
7  8   NaN

In [71]:
dp["Y"]=dp["Y"].interpolate(method="polynomial",order=2)
print(dp)

#The order parameter determines the degree of the polynomial used to estimate the missing values (NaNs).

   X     Y
0  1  10.0
1  2  20.0
2  3  30.0
3  4  40.0
4  5  50.0
5  6  60.0
6  7  70.0
7  8   NaN

In [5]:
import pandas as pd
A={
    "C":[1,2,3,4,5,6,7,8,9,10],
    "D":[10,NAN,30,NAN,50,NAN,70,NAN,90,NAN] # WE SHOULD NOT USE NAN TO REPRESENT MISSING VALUES IN PANDAS
}
pf=pd.DataFrame(A)
pf

NameError: name 'NAN' is not defined

In [ ]:
# | **When to Use**                   | **Use**  | **One-liner Explanation**                                                               |
# | --------------------------------- | -------- | --------------------------------------------------------------------------------------- |
# | Missing values in numeric columns | `np.nan` | Use for numbers; standard in pandas but needs `import numpy`.                           |
# | Missing values in any data type   | `pd.NA`  | Best all-rounder for pandas; supports strings, ints, bools — no NumPy needed.           |
# | Quick/easy missing values         | `None`   | Simple and auto-converted to `NaN`; good for basic use, but limited for advanced tasks. |

In [27]:
#linear interpolation using np.nan
import numpy as np  #explicitly
import pandas as pd
B={
    "D":[1,2,3,4,5,6,7,8,9,10],
    "E":[10,np.nan,30,np.nan,50,np.nan,70,np.nan,90,np.nan] # we can use np.nan or pd.NA or NONE to represent missing values
}
rf=pd.DataFrame(B)
print("before interpolation:")
print(rf)
print("after interpolation:")
rf["E"]=rf["E"].interpolate(method="linear")
print(rf)

before interpolation:
    D     E
0   1  10.0
1   2   NaN
2   3  30.0
3   4   NaN
4   5  50.0
5   6   NaN
6   7  70.0
7   8   NaN
8   9  90.0
9  10   NaN
after interpolation:
    D     E
0   1  10.0
1   2  20.0
2   3  30.0
3   4  40.0
4   5  50.0
5   6  60.0
6   7  70.0
7   8  80.0
8   9  90.0
9  10  90.0

In [39]:
#linear interpolation using None
Q={
    "W":[1,2,3,4,5,6,7,8,9,10],
    "X":[10,None,30,None,None,60,70,None,90,None]
}
qf=pd.DataFrame(Q)
print("before interpolation:")
print(qf)
qf["X"]=qf["X"].interpolate(method="linear")
print("after interpolation: ")
print(qf)

before interpolation:
    W     X
0   1  10.0
1   2   NaN
2   3  30.0
3   4   NaN
4   5   NaN
5   6  60.0
6   7  70.0
7   8   NaN
8   9  90.0
9  10   NaN
after interpolation:
    W     X
0   1  10.0
1   2  20.0
2   3  30.0
3   4  40.0
4   5  50.0
5   6  60.0
6   7  70.0
7   8  80.0
8   9  90.0
9  10  90.0

In [55]:
#polynomial interpolation
P={
    "U":[1,2,3,4,5,6,7,8,9,10],
    "O":[10,20,30,None,None,60,None,80,90,None]
}
uo=pd.DataFrame(P)
print("before interpolation:")
print(uo)
uo["O"]=uo["O"].interpolate(method="polynomial",order=2)
print(uo)

# Interpolation works between known values.
# It doesn’t fill missing values at the start or end (edges) if there are no valid surrounding points.
# The last None (at index 9) is at the end.
# There is no known value after it — so pandas can’t compute a polynomial fit for it.

before interpolation:
    U     O
0   1  10.0
1   2  20.0
2   3  30.0
3   4   NaN
4   5   NaN
5   6  60.0
6   7   NaN
7   8  80.0
8   9  90.0
9  10   NaN
    U     O
0   1  10.0
1   2  20.0
2   3  30.0
3   4  40.0
4   5  50.0
5   6  60.0
6   7  70.0
7   8  80.0
8   9  90.0
9  10   NaN

In [13]:
# time interpolation
## interpolation works best when values come at regular intervals, If intervals are not regular, interpolation may give wrong or misleading results.
import pandas as pd
T={
    "Date":pd.date_range(start="2025-07-25 00:00",periods=6,freq="H"),  #Pandas expects the date format in ISO format like "YYYY-MM-DD HH:MM"
    "Temperature":[20,None,30,None,50,60]                               #time-weighted interpolation only works on Series or DataFrames with a DatetimeIndex
}
tf=pd.DataFrame(T)
print("before interpolation: ")
print(tf)
tf.set_index("Date",inplace=True)
tf["Temperature"]=tf["Temperature"].interpolate(method="time")
print("after interpolation: ")
print(tf)

before interpolation:
                 Date  Temperature
0 2025-07-25 00:00:00         20.0
1 2025-07-25 01:00:00          NaN
2 2025-07-25 02:00:00         30.0
3 2025-07-25 03:00:00          NaN
4 2025-07-25 04:00:00         50.0
5 2025-07-25 05:00:00         60.0
after interpolation:
                     Temperature
Date
2025-07-25 00:00:00         20.0
2025-07-25 01:00:00         25.0
2025-07-25 02:00:00         30.0
2025-07-25 03:00:00         40.0
2025-07-25 04:00:00         50.0
2025-07-25 05:00:00         60.0

C:\Users\shaba\AppData\Local\Temp\ipykernel_21656\2871331801.py:5: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  "Date":pd.date_range(start="2025-07-25 00:00",periods=6,freq="H"),  #Pandas expects the date format in ISO format like "YYYY-MM-DD HH:MM"

In [23]:
#Sorting and Aggregation
#SORTING: Used to sort rows based on one or more column values.
# | Task                      | Code Example                                |
# | ------------------------- | ------------------------------------------- |
# | Sort by one column        | `df.sort_values(by="Age")`                  |
# | Sort by multiple columns  | `df.sort_values(by=["Age", "Name"])`        |
# | Sort descending           | `df.sort_values(by="Age", ascending=False)` |
# | Sort by index             | `df.sort_index()`                           |
# | Sort columns (by name)    | `df.sort_index(axis=1)`                     |
# | Modify original DataFrame | `inplace=True`                              |

#sorting one column(age) in ascending order
S={
    "Name":["Shabaul","Amaan","Pritam","Rehan"],
    "Age":[25,24,32,23],
    "Salary":[40000,50000,60000,70000]
}
sf=pd.DataFrame(S)
print("before sorting:")
print(sf)

sf.sort_values(by="Age",inplace=True)
print("after sorting:")
print(sf)

before sorting:
      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000
after sorting:
      Name  Age  Salary
3    Rehan   23   70000
1    Amaan   24   50000
0  Shabaul   25   40000
2   Pritam   32   60000

In [29]:
#sorting one column(age) in ascending order
S={
    "Name":["Shabaul","Amaan","Pritam","Rehan"],
    "Age":[25,24,32,23],
    "Salary":[40000,50000,60000,70000]
}
sf=pd.DataFrame(S)
print("before sorting:")
print(sf)

sf.sort_values(by="Age",ascending=True,inplace=True)
print("after sorting:")
print(sf)

before sorting:
      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000
after sorting:
      Name  Age  Salary
3    Rehan   23   70000
1    Amaan   24   50000
0  Shabaul   25   40000
2   Pritam   32   60000

In [33]:
#sorting one column(age) in descending order
S={
    "Name":["Shabaul","Amaan","Pritam","Rehan"],
    "Age":[25,24,32,23],
    "Salary":[40000,50000,60000,70000]
}
sf=pd.DataFrame(S)
print("before sorting:")
print(sf)

sf.sort_values(by="Age",ascending=False,inplace=True)
print("after sorting:")
print(sf)

before sorting:
      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000
after sorting:
      Name  Age  Salary
2   Pritam   32   60000
0  Shabaul   25   40000
1    Amaan   24   50000
3    Rehan   23   70000

In [39]:
#sorting two columns(age,salary) in ascending order
S={
    "Name":["Shabaul","Amaan","Pritam","Rehan"],
    "Age":[25,24,32,23],
    "Salary":[40000,50000,60000,70000]
}
sf=pd.DataFrame(S)
print("before sorting:")
print(sf)

sf.sort_values(by=["Age","Salary"],ascending=[True,True],inplace=True)
print("after sorting:")
print(sf)

# Step 1: Primary Sort — by Age
# Pandas first sorts all the rows by Age in ascending order.

# Step 2: Secondary Sort — by Salary
# If two or more rows have the same Age, then it sorts those tied rows by Salary.

before sorting:
      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000
after sorting:
      Name  Age  Salary
3    Rehan   23   70000
1    Amaan   24   50000
0  Shabaul   25   40000
2   Pritam   32   60000

In [43]:
S={
    "Name":["Shabaul","Amaan","Pritam","Rehan"],
    "Age":[25,24,32,23],
    "Salary":[40000,50000,60000,70000]
}
sf=pd.DataFrame(S)
print("before sorting:")
print(sf)

sf.sort_values(by=["Salary","Age"],ascending=[True,True],inplace=True)
print("after sorting:")
print(sf)

# Primary sort → by "Salary" (lowest to highest)
# Secondary sort → by "Age" (used only if salaries match)

before sorting:
      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000
after sorting:
      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000

In [47]:
# Aggregation means performing summary operations like:
# sum(), mean(), max(), min(), count(), etc.
# on our DataFrame to get insights from grouped or raw data.

#common aggregate function:=
# | Function   | Meaning           |
# | ---------- | ----------------- |
# | `sum()`    | Total             |
# | `mean()`   | Average           |
# | `count()`  | Number of entries |
# | `min()`    | Minimum value     |
# | `max()`    | Maximum value     |
# | `median()` | Middle value      |
# | `agg()`    | Combine multiple  |

#Simple syntax
# df.["column name"].mean()
# df.["column name"].mean()
# df.["column name"].mean()
# df.["column name"].mean()

In [9]:
import pandas as pd
S={
    "Name":["Shabaul","Amaan","Pritam","Rehan"],
    "Age":[25,24,32,23],
    "Salary":[40000,50000,60000,70000]
}
sf=pd.DataFrame(S)
print(sf)
meanage=sf["Age"].mean()
print("mean of age is",meanage)
minage=sf["Age"].min()
print("minimum of age is",minage)
maxage=sf["Age"].max()
print("maximum of age is",maxage)
countage=sf["Age"].count()
print("count of age is",countage)
sumage=sf["Age"].sum()
print("sum of age is",sumage)
medianage=sf["Age"].count()
print("median of age is",medianage)

      Name  Age  Salary
0  Shabaul   25   40000
1    Amaan   24   50000
2   Pritam   32   60000
3    Rehan   23   70000
mean of age is 26.0
minimum of age is 23
maximum of age is 32
count of age is 4
sum of age is 104
median of age is 4

In [13]:
print(sf["Age"].agg(["min", "max", "mean", "median","count","median"])) # agg() use to compute multiple aggregate functions in one time

min       23.0
max       32.0
mean      26.0
median    24.5
count      4.0
median    24.5
Name: Age, dtype: float64

In [4]:
#In Pandas, groupby() is used to group data based on one or more columns. It's a powerful method for data aggregation, transformation, and analysis.
#syntax: df.groupby('column_name'), a preparatory step for further operations like .sum(), .mean(
#df.groupby(['col1', 'col2']),You can also group by multiple columns, still not giving any output
import pandas as pd
gd=pd.DataFrame(
    {
        "Name":["Shabaul","Saif","Amaan","Pritam","Rehan"],
        "Age":[23,24,35,23,23],
        "Salary":[50000,60000,70000,80000,90000]
    }
    )
grouped=gd.groupby("Age") #it did group age , but no output just memory address
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002CD20E6E0C0>

In [8]:
import pandas as pd
gd=pd.DataFrame(
    {
        "Name":["Shabaul","Saif","Amaan","Pritam","Rehan"],
        "Age":[23,24,35,23,23],
        "Salary":[50000,60000,70000,80000,90000]
    }
    )
grouped=gd.groupby("Age")["Salary"] #it did group age , but still no output just memory address
print(grouped)

<pandas.core.groupby.generic.SeriesGroupBy object at 0x000002CD226B4DD0>

In [12]:
import pandas as pd
gd=pd.DataFrame(
    {
        "Name":["Shabaul","Saif","Amaan","Pritam","Rehan"],
        "Age":[23,24,35,23,24],
        "Salary":[50000,60000,70000,80000,90000]
    }
    )
grouped=gd.groupby("Age")["Salary"].mean() #find average salary now(of people with same age)
print(grouped)

Age
23    65000.0
24    75000.0
35    70000.0
Name: Salary, dtype: float64

In [18]:
import pandas as pd
# Creating a DataFrame with Name, Age, and Salary columns
gd=pd.DataFrame(
    {
        "Name":["Shabaul","Saif","Amaan","Pritam","Rehan"],
        "Age":[23,24,35,23,24],
        "Salary":[50000,60000,70000,80000,90000]
    }
    )
grouped=gd.groupby("Age")["Salary"].max()  # Grouping the data by 'Age' and finding the highest salary in each age group
print(grouped)

Age
23    80000
24    90000
35    70000
Name: Salary, dtype: int64

In [28]:
# groupby using multiple columns
import pandas as pd
gdm=pd.DataFrame({
        "Name":["Shabaul","Saif","Amaan","Pritam","Rehan"],
        "Age":[23,24,35,23,24],
        "Salary":[50000,60000,70000,80000,90000]
})
groupmultiple=gdm.groupby(["Age","Name"])["Salary"].sum()
print(groupmultiple)

Age  Name
23   Pritam     80000
     Shabaul    50000
24   Rehan      90000
     Saif       60000
35   Amaan      70000
Name: Salary, dtype: int64

In [30]:
# Importing the pandas library
import pandas as pd

# Creating a DataFrame with Name, Age, and Salary
gdm = pd.DataFrame({
    "Name": ["Shabaul", "Saif", "Amaan", "Pritam", "Rehan"],
    "Age": [23, 24, 35, 23, 24],
    "Salary": [50000, 60000, 70000, 80000, 90000]
})

# Grouping the data by both 'Age' and 'Name' columns
# This will group rows where both Age and Name match, then calculate the total salary for each group
groupmultiple = gdm.groupby(["Age", "Name"])["Salary"].sum()

# Printing the grouped result
print(groupmultiple)

# the .sum() function is not adding anything in this case because each (Age, Name) pair is unique in the DataFrame.
# There are no duplicate entries to add together.

Age  Name
23   Pritam     80000
     Shabaul    50000
24   Rehan      90000
     Saif       60000
35   Amaan      70000
Name: Salary, dtype: int64

In [34]:
import pandas as pd

# Creating a DataFrame with duplicate 'Name' and 'Age' combination
gdm = pd.DataFrame({
    "Name": ["Shabaul", "Saif", "Amaan", "Shabaul", "Rehan"],
    "Age": [23, 24, 35, 23, 24],
    "Salary": [50000, 60000, 70000, 80000, 90000]
})

# Grouping by 'Age' and 'Name', then summing salaries
# Since "Shabaul" with Age 23 appears twice, their salaries are added together
groupmultiple = gdm.groupby(["Age", "Name"])["Salary"].sum()

# Printing the grouped result
print(groupmultiple)

Age  Name
23   Shabaul    130000
24   Rehan       90000
     Saif        60000
35   Amaan       70000
Name: Salary, dtype: int64

In [42]:
# Merging in Pandas (pd.merge) and joining
# merge() is used to combine two DataFrames based on one or more common columns (like SQL JOINs).
# merge() in Pandas can combine two DataFrames at a time only.

df_customers=pd.DataFrame({
    "Customer_ID":[1,2,3],
    "Name":["Shabaul","Amaan","Pritam"]
})
df_orders=pd.DataFrame({
    "Customer_ID":[1,2,4],
    "OrderAmount":[250,450,350]
})
merged=pd.merge(df_customers,df_orders, on="Customer_ID",how="inner")
print(merged)

   Customer_ID     Name  OrderAmount
0            1  Shabaul          250
1            2    Amaan          450

In [46]:
#Merging 3 DataFrames
#we can merge multiple DataFrames by chaining merge() calls.
import pandas as pd

df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [1, 2], 'Age': [25, 30]})
df3 = pd.DataFrame({'ID': [1, 2], 'Salary': [50000, 60000]})

# Merge df1 and df2 first
merged1 = pd.merge(df1, df2, on='ID')

# Then merge the result with df3
final_merged = pd.merge(merged1, df3, on='ID')

print(final_merged)

   ID   Name  Age  Salary
0   1  Alice   25   50000
1   2    Bob   30   60000

In [50]:
# | **Join Type** | **Definition (Easy Words)**                               | **Keeps All Rows From** | **Rows Without Match?** | **Missing Values Filled With** |
# | ------------- | --------------------------------------------------------- | ----------------------- | ----------------------- | ------------------------------ |
# | `inner`       | Keeps only rows where keys match in both DataFrames       | Matching in both        | ❌ Removed               | –                              |
# | `left`        | Keeps all rows from the **left** DataFrame                | Left                    | ✅ From left side        | `NaN` in right columns         |
# | `right`       | Keeps all rows from the **right** DataFrame               | Right                   | ✅ From right side       | `NaN` in left columns          |
# | `outer`       | Keeps all rows from **both** DataFrames (full outer join) | Both                    | ✅ From both sides       | `NaN` where no match           |

# What is a Cross Join?
# A cross join (also called Cartesian product) returns every combination of rows from two DataFrames.
# Each row from the first table is paired with every row from the second table.
# If:
# df1 has 3 rows
# df2 has 2 rows
# ➡️ Cross join will give 3 × 2 = 6 rows

#example of cross join: 
import pandas as pd

# First DataFrame
df1 = pd.DataFrame({
    'Name': ['Alice', 'Bob']
})

# Second DataFrame
df2 = pd.DataFrame({
    'Subject': ['Math', 'Science']
})

# Cross Join
cross = df1.merge(df2, how='cross')
print(cross)

    Name  Subject
0  Alice     Math
1  Alice  Science
2    Bob     Math
3    Bob  Science